cf/Documents/ОплатаИмпорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОплатаИмпорт</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыИмпорт</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказамПоставщику</xr:Item>
				<xr:Item>AccumulationRegister.ОплатыПоИнвойсу</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДопрасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУпр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДопрасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/ОплатыИмпорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ОплатыИмпорт</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инвойс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Инвойс</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/ОплатаИмпорт/Forms/ФормаЗаполненияРасшифровки/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьТаблицуЗначенийСтрокой()
	
	НовТабл = ТабИнвойсы.Выгрузить();
	НовТабл.Очистить();
	
	СтрокиОплат = ТабИнвойсы.НайтиСтроки(Новый Структура("Оплатить", Истина));
	
	Для Каждого Строка Из СтрокиОплат Цикл
		ЗаполнитьЗначенияСвойств(НовТабл.Добавить(), Строка);
	КонецЦикла;
	
	Возврат ЗначениеВСтрокуВнутр(НовТабл);
	
КонецФункции
&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПолучитьТаблицуЗначенийСтрокой());
	
КонецПроцедуры


Процедура ЗаполнитьТаблицу()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Инвойс, СуммаПриход СуммаИнвойса, СуммаКонечныйОстаток ДолгПоОплате ИЗ РегистрНакопления.ОплатыИмпорт.ОстаткиИОбороты(, &КонецПериода) ГДЕ СуммаКонечныйОстаток <> 0");
	Запрос.УстановитьПараметр("КонецПериода", ДокументОплаты.Дата);
	ТабИнвойсы.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументОплаты = Параметры.ДокументОплаты;
	Сумма = Параметры.Сумма;
	СуммаРаспределить = Сумма;
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьШапку()
	
	СуммаРаспределить = Сумма -  ТабИнвойсы.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТабИнвойсыОплатитьПриИзменении(Элемент)
	ТекДанные = Элементы.ТабИнвойсы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если НЕ СуммаРаспределить Тогда
			ТекДанные.Оплатить = Ложь; КонецЕсли;
		ТекДанные.Сумма = ?(ТекДанные.Оплатить, Мин(СуммаРаспределить, ТекДанные.ДолгПоОплате), 0); 
		ПересчитатьШапку();
	КонецЕсли;
		
КонецПроцедуры
